OFfinal/airfoil-base/system/blockMeshDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	object	blockMeshDict;
}

convertToMeters 1.0;

vertices
(
	(-2.0 3.5 0) // 0
	(-1.5 3.5 0) // 1
	(0 3.5 0) // 2
	(1.5 3.5 0) // 3
	(7.0 3.5 0) // 4
	(7.0 0 0) // 5
	(7.0 -3.5 0) // 6
	(1.5 -3.5 0) // 7
	(0 -3.5 0) // 8
	(-1.5 -3.5 0) // 9
	(-2.0 -3.5 0) // 10
	(-2.0 0 0) // 11
	(-1.5 0 0) // 12
	(0 1.2886751345948129 0) // 13
	(1.5 0 0) // 14
	(0 -1.2886751345948129 0) // 15
	(-0.5 0 0) // 16
	(0 0.28867513459481287 0) // 17
	(0.5 0 0) // 18
	(0 -0.28867513459481287 0) // 19
	(-2.0 3.5 0.1) // 20
	(-1.5 3.5 0.1) // 21
	(0 3.5 0.1) // 22
	(1.5 3.5 0.1) // 23
	(7.0 3.5 0.1) // 24
	(7.0 0 0.1) // 25
	(7.0 -3.5 0.1) // 26
	(1.5 -3.5 0.1) // 27
	(0 -3.5 0.1) // 28
	(-1.5 -3.5 0.1) // 29
	(-2.0 -3.5 0.1) // 30
	(-2.0 0 0.1) // 31
	(-1.5 0 0.1) // 32
	(0 1.2886751345948129 0.1) // 33
	(1.5 0 0.1) // 34
	(0 -1.2886751345948129 0.1) // 35
	(-0.5 0 0.1) // 36
	(0 0.28867513459481287 0.1) // 37
	(0.5 0 0.1) // 38
	(0 -0.28867513459481287 0.1) // 39
);

blocks
(
	// block0
	hex (31 20 21 32 11 0 1 12 ) (15 10 1) simpleGrading (4 1.0 1)
	// block1
	hex (32 21 22 33 12 1 2 13 ) (15 15 1) simpleGrading (4 1.0 1)
	// block2
	hex (33 22 23 34 13 2 3 14 ) (15 15 1) simpleGrading (4 1 1)
	// block3
	hex (34 23 24 25 14 3 4 5 ) (15 30 1) simpleGrading (4 4 1)
	// block4
	hex (25 26 27 34 5 6 7 14 ) (15 30 1) simpleGrading (4 0.25 1)
	// block5
	hex (34 27 28 35 14 7 8 15 ) (15 15 1) simpleGrading (4 1.0 1)
	// block6
	hex (35 28 29 32 15 8 9 12 ) (15 15 1) simpleGrading (4 1 1)
	// block7
	hex (32 29 30 31 12 9 10 11 ) (15 10 1) simpleGrading (4 1 1)
	// block8
	hex (32 33 37 36 12 13 17 16 ) (15 10 1) simpleGrading (1.0 1.0 1)
	// block9
	hex (37 33 34 38 17 13 14 18 ) (10 15 1) simpleGrading (1 1 1)
	// block10
	hex (34 35 39 38 14 15 19 18 ) (15 10 1) simpleGrading (1.0 1.0 1)
	// block11
	hex (39 35 32 36 19 15 12 16 ) (10 15 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

	inlet
	{
		type patch;
		faces
		(
			(0 20 31 11)
			(11 31 30 10)
		);
	}

	outlet
	{
		type zeroGradient;
		faces
		(
			(4 24 25 5)
			(5 25 26 6)
		);
	}

	top
	{
		type zeroGradient;
		faces
		(
			(0 1 21 20)
			(1 2 22 21)
			(2 3 23 22)
			(3 4 24 23)
		);
	}

	bottom
	{
		type zeroGradient;
		faces
		(
			(6 7 27 26)
			(7 8 28 27)
			(8 9 29 28)
			(9 10 30 29)
		);
	}

	airfoil
	{
		type wall;
		faces
		(
			(16 17 37 36)
			(17 18 38 37)
			(18 19 39 38)
			(19 16 36 39)
		);
	}

);