OFfinal/airfoil-base/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3.91259 0.83165 0);

boundaryField
{
    top 
    {
        type            zeroGradient;
    }

    bottom 
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value    uniform (3.91259 0.83165 0);
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      uniform (3.91259 0.83165 0);
        value           uniform (3.91259 0.83165 0); 
    }

    airfoil 
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
